### Data Structure in Pandas
  - <h4> Series 
  - <h4> DataFrame

In [1]:
import pandas as pd
import numpy as np

<h5><b>Series</b> is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index.

In [2]:
s=pd.Series(['a','b','c'],index=[10,20,30])

In [3]:
d = {'name':['rakesh','roshan'], 'age':[23, 45]}
pd.Series(d)

name    [rakesh, roshan]
age             [23, 45]
dtype: object

In [4]:
s = pd.Series(np.random.randn(10))

In [5]:
for i in s:
    print(i)

-0.1095600910114643
-0.11232025317612304
1.41974461572764
0.8456098132233011
-0.3649883379238045
1.2730836381871937
-0.7217453362006129
1.2246404262180706
0.37637186428744707
-1.2122902265482451

In [6]:
len(s)
s[3] = 0

In [7]:
print(s)

0   -0.109560
1   -0.112320
2    1.419745
3    0.000000
4   -0.364988
5    1.273084
6   -0.721745
7    1.224640
8    0.376372
9   -1.212290
dtype: float64

In [8]:
s * 20
s + 4
np.sqrt(s)
np.exp(s)

/Applications/cconda/anaconda3/lib/python3.13/site-packages/pandas/core/arraylike.py:399: RuntimeWarning: invalid value encountered in sqrt
  result = getattr(ufunc, method)(*inputs, **kwargs)

0    0.896228
1    0.893758
2    4.136064
3    1.000000
4    0.694205
5    3.571850
6    0.485903
7    3.402942
8    1.456989
9    0.297515
dtype: float64

#### <b>DataFrame</b> is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects.

In [9]:
df1 = pd.DataFrame(s,columns=['number'])
type(df1)

pandas.core.frame.DataFrame

In [10]:
d
df2 = pd.DataFrame(d)

In [11]:
import seaborn as sns

In [12]:
#sns.get_dataset_names()
df3 = sns.load_dataset('tips')

In [13]:
df3.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [14]:
type(df3[['total_bill','tip']])

pandas.core.frame.DataFrame

In [15]:
df3.shape

(244, 7)

In [16]:
df3.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [17]:
df3.tail(10)

     total_bill   tip     sex smoker   day    time  size
234       15.53  3.00    Male    Yes   Sat  Dinner     2
235       10.07  1.25    Male     No   Sat  Dinner     2
236       12.60  1.00    Male    Yes   Sat  Dinner     2
237       32.83  1.17    Male    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [18]:
pd.read_csv()

TypeError: read_csv() missing 1 required positional argument: 'filepath_or_buffer'

In [ ]:
df3.loc[:]